# St7SetBrickHeatSource1

Sets a heat source to the specified brick.

long St7SetBrickHeatSource1(long uID, long BrickNum, long CaseNum,

double* Doubles)

Input Parameters

uID

Strand7 model file ID.

BrickNum

Brick number.

CaseNum

Load case number.

Doubles[0]

Heat source.